nongxiaoming/DAPLinkTiny/Software/Libraries/hic_hal/at32/at32f415/usbd_AT32F4xx_FS.c
      if (EP_OUT_TYPE(num) != USB_ENDPOINT_TYPE_ISOCHRONOUS) continue;
      if (((DOEPCTL(num) >> 15) & 1) == 0)                   continue;

      /* incomplete isochronous out transfer                                  */
      if (OTG->GINTSTS & ISTR_INCOMISOOUTM) {
        if ((USBD_GetFrame() & 1) == ((DOEPCTL(num) >> 16) & 1)) {
          if (DOEPCTL(num) & (1UL << 31)) {
            InPacketDataCnt[num] = 0;   /* discard data                       */
            DOEPCTL(num) |= (1UL << 30);/* disable endpoint                   */
          }
        }

      /* prepare for next isohronous transfer                                 */
      } else {
        DOEPTSIZ(num) = (1 << 19) |                /* packet count            */
                        (OutMaxPacketSize[num]);   /* transfer size           */

        if ((USBD_GetFrame() & 1)) DOEPCTL(num) |= (1 << 28); /* even frame   */
        else                       DOEPCTL(num) |= (1 << 29); /* odd frame    */

        DOEPCTL(num)    |= (1UL <<31) | (1 << 26);
      }
    }
    OTG->GINTSTS = ISTR_EOPF | ISTR_INCOMISOOUTM;
  }

/* incomplete isochronous IN transfer                                         */
  if (istr & ISTR_INCOMISOIN) {
    OTG->GINTSTS = ISTR_INCOMISOIN;
    for (num = 1; num < (USBD_EP_NUM + 1); num++) {

      if (EP_IN_TYPE(num) != USB_ENDPOINT_TYPE_ISOCHRONOUS) continue;
      if (((DIEPCTL(num) >> 15) & 1) == 0)                  continue;

      if (DIEPCTL(num) & (1UL << 31)) { /* if EP en & packet frame is incorect*/
        if ((USBD_GetFrame() & 1) == ((DIEPCTL(num) >> 16) & 1)) {
          
          IsoInIncomplete |= (1 << num);
          DIEPCTL(num)    |= (1UL << 30) | (1 << 27);
        }
      }
    }
  }
}
